# Pandas

In [1]:
import pandas as pd 
import numpy as np

In [2]:
s = pd.Series([1,3,4,np.nan,6,8])
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20250101",periods=6)

In [4]:
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index=dates, columns=list("ABCD"))

In [7]:
df

                   A         B         C         D
2025-01-01  0.709747 -2.064593 -0.206277 -0.913127
2025-01-02  0.094995 -0.582616  0.565145 -0.425700
2025-01-03 -1.330978  1.684357  0.021680 -0.905691
2025-01-04 -1.073299 -0.069019  0.487861  1.657775
2025-01-05  0.516637  0.602860  2.673120  0.242438
2025-01-06 -0.793981  1.028952 -0.750240 -1.133519

In [10]:
df2 = pd.DataFrame(
    {
    "A":1.0,
    "B":pd.Timestamp("20250101"),
    "C":pd.Series(1,index=list(range(4)),dtype="float32"),
    "D":np.array([3]*4,dtype='int32'),
    "E":pd.Categorical(["test","train","test","train"]),
    "F":"foo"
    }
)

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2025-01-01  1.0  3   test  foo
1  1.0 2025-01-01  1.0  3  train  foo
2  1.0 2025-01-01  1.0  3   test  foo
3  1.0 2025-01-01  1.0  3  train  foo

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing Data

In [14]:
df.head()

                   A         B         C         D
2025-01-01  0.709747 -2.064593 -0.206277 -0.913127
2025-01-02  0.094995 -0.582616  0.565145 -0.425700
2025-01-03 -1.330978  1.684357  0.021680 -0.905691
2025-01-04 -1.073299 -0.069019  0.487861  1.657775
2025-01-05  0.516637  0.602860  2.673120  0.242438

In [15]:
df.tail(3)

                   A         B         C         D
2025-01-04 -1.073299 -0.069019  0.487861  1.657775
2025-01-05  0.516637  0.602860  2.673120  0.242438
2025-01-06 -0.793981  1.028952 -0.750240 -1.133519

In [16]:
df.index

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.to_numpy()

array([[ 0.70974684, -2.06459272, -0.20627742, -0.91312706],
       [ 0.09499468, -0.58261588,  0.56514532, -0.42570029],
       [-1.33097782,  1.68435736,  0.02168044, -0.90569064],
       [-1.07329921, -0.06901937,  0.48786106,  1.65777521],
       [ 0.51663727,  0.60286025,  2.67311969,  0.24243791],
       [-0.79398059,  1.02895168, -0.75024046, -1.13351878]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.312813  0.099990  0.465215 -0.246304
std    0.865615  1.327102  1.184086  1.054814
min   -1.330978 -2.064593 -0.750240 -1.133519
25%   -1.003470 -0.454217 -0.149288 -0.911268
50%   -0.349493  0.266920  0.254771 -0.665695
75%    0.411227  0.922429  0.545824  0.075403
max    0.709747  1.684357  2.673120  1.657775

In [21]:
df.T

   2025-01-01  2025-01-02  2025-01-03  2025-01-04  2025-01-05  2025-01-06
A    0.709747    0.094995   -1.330978   -1.073299    0.516637   -0.793981
B   -2.064593   -0.582616    1.684357   -0.069019    0.602860    1.028952
C   -0.206277    0.565145    0.021680    0.487861    2.673120   -0.750240
D   -0.913127   -0.425700   -0.905691    1.657775    0.242438   -1.133519

In [22]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2025-01-01 -0.913127 -0.206277 -2.064593  0.709747
2025-01-02 -0.425700  0.565145 -0.582616  0.094995
2025-01-03 -0.905691  0.021680  1.684357 -1.330978
2025-01-04  1.657775  0.487861 -0.069019 -1.073299
2025-01-05  0.242438  2.673120  0.602860  0.516637
2025-01-06 -1.133519 -0.750240  1.028952 -0.793981

In [23]:
df.sort_values(by="B")

                   A         B         C         D
2025-01-01  0.709747 -2.064593 -0.206277 -0.913127
2025-01-02  0.094995 -0.582616  0.565145 -0.425700
2025-01-04 -1.073299 -0.069019  0.487861  1.657775
2025-01-05  0.516637  0.602860  2.673120  0.242438
2025-01-06 -0.793981  1.028952 -0.750240 -1.133519
2025-01-03 -1.330978  1.684357  0.021680 -0.905691

# Selection

In [24]:
df['A']

2025-01-01    0.709747
2025-01-02    0.094995
2025-01-03   -1.330978
2025-01-04   -1.073299
2025-01-05    0.516637
2025-01-06   -0.793981
Freq: D, Name: A, dtype: float64

In [25]:
df[0:3]

                   A         B         C         D
2025-01-01  0.709747 -2.064593 -0.206277 -0.913127
2025-01-02  0.094995 -0.582616  0.565145 -0.425700
2025-01-03 -1.330978  1.684357  0.021680 -0.905691

In [26]:
df.loc[dates[0]]

A    0.709747
B   -2.064593
C   -0.206277
D   -0.913127
Name: 2025-01-01 00:00:00, dtype: float64

In [27]:
df.loc[dates[0],"A"]

0.7097468422751817

In [28]:
df.at[dates[0],"A"]

0.7097468422751817

In [29]:
df.iloc[3]

A   -1.073299
B   -0.069019
C    0.487861
D    1.657775
Name: 2025-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5,0:2]

                   A         B
2025-01-04 -1.073299 -0.069019
2025-01-05  0.516637  0.602860

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2025-01-02  0.094995  0.565145
2025-01-03 -1.330978  0.021680
2025-01-05  0.516637  2.673120

In [32]:
df.iloc[1:2,:]

                   A         B         C       D
2025-01-02  0.094995 -0.582616  0.565145 -0.4257

# Setting

In [33]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20250101",periods=6))
s1

2025-01-01    1
2025-01-02    2
2025-01-03    3
2025-01-04    4
2025-01-05    5
2025-01-06    6
Freq: D, dtype: int64

In [34]:
df['F']=s1

In [35]:
df

                   A         B         C         D  F
2025-01-01  0.709747 -2.064593 -0.206277 -0.913127  1
2025-01-02  0.094995 -0.582616  0.565145 -0.425700  2
2025-01-03 -1.330978  1.684357  0.021680 -0.905691  3
2025-01-04 -1.073299 -0.069019  0.487861  1.657775  4
2025-01-05  0.516637  0.602860  2.673120  0.242438  5
2025-01-06 -0.793981  1.028952 -0.750240 -1.133519  6

In [36]:
df.at[dates[0],'A'] = 0

In [37]:
df.iat[0,1] = 0

In [39]:
df.loc[:,'D'] = np.array([5]*len(df))

/var/folders/vy/bpb645w940104xm12cdmq4b80000gn/T/ipykernel_20309/1545664037.py:1: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:,'D'] = np.array([5]*len(df))

In [40]:
df

                   A         B         C  D  F
2025-01-01  0.000000  0.000000 -0.206277  5  1
2025-01-02  0.094995 -0.582616  0.565145  5  2
2025-01-03 -1.330978  1.684357  0.021680  5  3
2025-01-04 -1.073299 -0.069019  0.487861  5  4
2025-01-05  0.516637  0.602860  2.673120  5  5
2025-01-06 -0.793981  1.028952 -0.750240  5  6

# Missing Data

In [41]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])

In [43]:
df1.loc[dates[0]:dates[1],"E"] = 1

In [44]:
df1

                   A         B         C  D  F    E
2025-01-01  0.000000  0.000000 -0.206277  5  1  1.0
2025-01-02  0.094995 -0.582616  0.565145  5  2  1.0
2025-01-03 -1.330978  1.684357  0.021680  5  3  NaN
2025-01-04 -1.073299 -0.069019  0.487861  5  4  NaN

In [45]:
df1.dropna(how='any')

                   A         B         C  D  F    E
2025-01-01  0.000000  0.000000 -0.206277  5  1  1.0
2025-01-02  0.094995 -0.582616  0.565145  5  2  1.0

In [46]:
df1.fillna(value=5)

                   A         B         C  D  F    E
2025-01-01  0.000000  0.000000 -0.206277  5  1  1.0
2025-01-02  0.094995 -0.582616  0.565145  5  2  1.0
2025-01-03 -1.330978  1.684357  0.021680  5  3  5.0
2025-01-04 -1.073299 -0.069019  0.487861  5  4  5.0

In [47]:
pd.isna(df1)

                A      B      C      D      F      E
2025-01-01  False  False  False  False  False  False
2025-01-02  False  False  False  False  False  False
2025-01-03  False  False  False  False  False   True
2025-01-04  False  False  False  False  False   True

# Operations

In [48]:
df.mean()

A   -0.431104
B    0.444089
C    0.465215
D    5.000000
F    3.500000
E    1.000000
dtype: float64

In [49]:
df.mean(axis=1)

2025-01-01    1.132287
2025-01-02    1.346254
2025-01-03    1.675012
2025-01-04    1.669108
2025-01-05    2.758523
2025-01-06    2.096946
Freq: D, dtype: float64

In [50]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [51]:
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    5.0
2025-01-06    NaN
Freq: D, dtype: float64

In [52]:
df.sub(s,axis='index')

                   A         B         C    D    F   E
2025-01-01       NaN       NaN       NaN  NaN  NaN NaN
2025-01-02       NaN       NaN       NaN  NaN  NaN NaN
2025-01-03 -2.330978  0.684357 -0.978320  4.0  2.0 NaN
2025-01-04 -4.073299 -3.069019 -2.512139  2.0  1.0 NaN
2025-01-05 -4.483363 -4.397140 -2.326880  0.0  0.0 NaN
2025-01-06       NaN       NaN       NaN  NaN  NaN NaN

# User Defined Functions

In [53]:
df.agg(lambda x: np.mean(x)*5.6)

A    -2.414184
B     2.486898
C     2.605203
D    28.000000
F    19.600000
E     5.600000
dtype: float64

In [54]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F      E
2025-01-01    0.000000    0.000000  -20.875275  506.0  101.2  101.2
2025-01-02    9.613462  -58.960727   57.192707  506.0  202.4  101.2
2025-01-03 -134.694956  170.456965    2.194060  506.0  303.6    NaN
2025-01-04 -108.617880   -6.984760   49.371539  506.0  404.8    NaN
2025-01-05   52.283692   61.009457  270.519712  506.0  506.0    NaN
2025-01-06  -80.350836  104.129910  -75.924335  506.0  607.2    NaN

# Values Counts

In [55]:
s = pd.Series(np.random.randint(0,7,size = 10))
s

0    5
1    0
2    3
3    0
4    5
5    0
6    0
7    2
8    1
9    3
dtype: int64

In [56]:
s.value_counts()

0    4
5    2
3    2
2    1
1    1
dtype: int64

# String Methods

In [57]:
s = pd.Series(['A','B','C',"AaBa","Baca",np.nan, "CBAB", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    cbab
7     dog
8     cat
dtype: object

# Merge

In [58]:
# Concat

df = pd.DataFrame(np.random.randn(10,4))

In [59]:
df

          0         1         2         3
0 -0.889749 -0.675782  2.296938  0.185304
1 -0.644022 -0.110882 -0.058464 -1.780325
2 -0.436561  1.211615 -1.014907  2.041077
3 -1.008366  0.116925  0.633985  1.069975
4 -0.994226  1.007791 -1.426918  0.732748
5  0.288946 -0.483211 -0.815509  0.979513
6 -1.260025  0.985399  0.463248 -1.297515
7  0.347818  1.072576  1.061560 -0.537691
8  0.260043 -1.246278  0.719216 -0.948247
9  1.694802 -2.129690 -0.515294 -1.132835

In [60]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.889749 -0.675782  2.296938  0.185304
 1 -0.644022 -0.110882 -0.058464 -1.780325
 2 -0.436561  1.211615 -1.014907  2.041077,
           0         1         2         3
 3 -1.008366  0.116925  0.633985  1.069975
 4 -0.994226  1.007791 -1.426918  0.732748
 5  0.288946 -0.483211 -0.815509  0.979513
 6 -1.260025  0.985399  0.463248 -1.297515,
           0         1         2         3
 7  0.347818  1.072576  1.061560 -0.537691
 8  0.260043 -1.246278  0.719216 -0.948247
 9  1.694802 -2.129690 -0.515294 -1.132835]

In [61]:
pd.concat(pieces)

          0         1         2         3
0 -0.889749 -0.675782  2.296938  0.185304
1 -0.644022 -0.110882 -0.058464 -1.780325
2 -0.436561  1.211615 -1.014907  2.041077
3 -1.008366  0.116925  0.633985  1.069975
4 -0.994226  1.007791 -1.426918  0.732748
5  0.288946 -0.483211 -0.815509  0.979513
6 -1.260025  0.985399  0.463248 -1.297515
7  0.347818  1.072576  1.061560 -0.537691
8  0.260043 -1.246278  0.719216 -0.948247
9  1.694802 -2.129690 -0.515294 -1.132835

In [63]:
# Join

left = pd.DataFrame({"key":['foo', 'foo'], "lval":[1,2]})

In [64]:
right = pd.DataFrame({"key":['foo','foo'],"rval":[4,5]})

In [65]:
left

   key  lval
0  foo     1
1  foo     2

In [66]:
right

   key  rval
0  foo     4
1  foo     5

In [67]:
pd.merge(left, right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

# Importing and Exporting Data

In [68]:
df = pd.DataFrame(np.random.randint(0,5,(10,5)))

In [69]:
df

   0  1  2  3  4
0  1  3  4  0  3
1  3  4  3  2  3
2  4  0  2  3  4
3  3  2  0  1  1
4  0  1  2  3  0
5  2  1  3  2  3
6  2  3  3  2  0
7  0  2  2  3  2
8  3  4  1  2  0
9  4  3  3  4  1

In [70]:
df.to_csv("foo.csv")

In [71]:
pd.read_csv('foo.csv')

   Unnamed: 0  0  1  2  3  4
0           0  1  3  4  0  3
1           1  3  4  3  2  3
2           2  4  0  2  3  4
3           3  3  2  0  1  1
4           4  0  1  2  3  0
5           5  2  1  3  2  3
6           6  2  3  3  2  0
7           7  0  2  2  3  2
8           8  3  4  1  2  0
9           9  4  3  3  4  1

In [73]:
df.to_excel('foo.xlsx', sheet_name="sheet1")

In [74]:
pd.read_excel("foo.xlsx", "sheet1", index_col=None, na_values=["NA"])

   Unnamed: 0  0  1  2  3  4
0           0  1  3  4  0  3
1           1  3  4  3  2  3
2           2  4  0  2  3  4
3           3  3  2  0  1  1
4           4  0  1  2  3  0
5           5  2  1  3  2  3
6           6  2  3  3  2  0
7           7  0  2  2  3  2
8           8  3  4  1  2  0
9           9  4  3  3  4  1